{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 150, 150, 3], "sparse": false, "name": "input"}, "class_name": "InputLayer", "name": "input", "inbound_nodes": []}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_1", "filters": 32, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "units": 8, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5"}